Revit 2027 API
DocumentDifference Methods
The DocumentDifference type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetCreatedElementIds |  Created element id collection.
GetDeletedElementIds |  Deleted element id collection. For non-worksharing models, this will always be an empty collection.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetModifiedElementIds |  Modified element id collection.
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
DocumentDifference Class
Autodesk.Revit.DB Namespace